[
   {
      "message": "Will BCI433 be offered in online format for this fall semester.",
      "is_ivan": true
   },
   {
      "message": "I am in CPA",
      "is_ivan": true
   },
   {
      "message": "Actually I think china is even worse?",
      "is_ivan": true
   },
   {
      "message": "I mean what about CPA/CPP? wouldn't those also be online if BSD is online?",
      "is_ivan": true
   },
   {
      "message": "Does Seneca still have a vaccine policy. I haven’t checked recently. Could someone update me with that information. Also are fall classes going to still offer an online option. Not everyone studying at Seneca is vaccinated and that is something that Seneca college needs to consider without forcing others to get vaccinated.",
      "is_ivan": true
   },
   {
      "message": "Is anyone taking co-op this summer in CPA program.",
      "is_ivan": true
   },
   {
      "message": "I will hold my patience in. Sorry for rushing you.",
      "is_ivan": true
   },
   {
      "message": "Can you sent it now? Your service is like fedex shipping.",
      "is_ivan": true
   },
   {
      "message": "When do you plan on doing it? Just so I know.",
      "is_ivan": true
   },
   {
      "message": "@David agnew Remember we discussed about Gen Ed’s. You said you were going to send me the addendum for NAT542 and CUL202. Could you please do it now. This is the same person.",
      "is_ivan": true
   },
   {
      "message": "Should I take cyber security program after CPA. Is it hacking in cyber security?",
      "is_ivan": true
   },
   {
      "message": "But I have to think outside the box when I am picking my courses.",
      "is_ivan": true
   },
   {
      "message": "I calculated and I believe it is a year and a half if I take 3 courses every semester for BSD.",
      "is_ivan": true
   },
   {
      "message": "Do they have part time for BSD?",
      "is_ivan": true
   },
   {
      "message": "It could work it is just not practical, because if something does not go to plan I fail BSD program.",
      "is_ivan": true
   },
   {
      "message": "But doesn't the 3rd and 6th semester take place during the summer semester?",
      "is_ivan": true
   },
   {
      "message": "I just can't handle 5 course in 1 semester. I am in CPA right now. I did 5 courses in 1 semester for semesters 1,",
      "is_ivan": true
   },
   {
      "message": "2, and 3. At one point I was going to die because I actually got multiple heart attacks because even working my but of as hard as I can for 14 hours every single day including on weeekend. I was still extremely worried if I would learn everything and do the best that is excpected of me.",
      "is_ivan": true
   },
   {
      "message": "Then how about a very strict schedule and taking exactly 3 courses every semester even during the summer. And never failing a course in the whole program?",
      "is_ivan": true
   },
   {
      "message": "I know, but if you do it right away the next year. And everything goes as to plan will it work. To graduate in 8 years?",
      "is_ivan": true
   },
   {
      "message": "@Justin You might want to hear the answer to this question. If you want to take BSD program for whatever reason. I heard you are like me and can only metaly handle 3 courses per semester, and that is ok. We have differences, but everyone are brilliant people at the end.",
      "is_ivan": true
   },
   {
      "message": "Are you allowed in BSD to split and take 2 or 3 courses per semester and take 8 years till you graduate instead of the usual 4 years?",
      "is_ivan": true
   },
   {
      "message": "2 more hours guy before the truth gets unmarked regarding the strike.",
      "is_ivan": true
   },
   {
      "message": "You have to wait till tomorrow to say that. No one knows yet.",
      "is_ivan": true
   },
   {
      "message": "Does anyone know if Exams were canceled in 2017 because of the strike? I ask because history repeats itself.",
      "is_ivan": true
   },
   {
      "message": "It is Derek. I made a typo",
      "is_ivan": true
   },
   {
      "message": "That is what I thought.",
      "is_ivan": true
   },
   {
      "message": "@David agnew Do you know if the Seneca Campuses are going to be open during the strike?",
      "is_ivan": true
   },
   {
      "message": "Does anyone know if the Seneca Campuses are going to be open during the strike?",
      "is_ivan": true
   },
   {
      "message": "I don’t think Macdonalds sponsores the Raptors anymore.",
      "is_ivan": true
   },
   {
      "message": "Then what about for HR interviews. What are the common questions, and red flags to stay away from?",
      "is_ivan": true
   },
   {
      "message": "The free fries are gone. When was the last game they played?",
      "is_ivan": true
   },
   {
      "message": "Do you think BCI433 will still be available 1 or 2 years from now. I applies for CPA in Fall of 2020. I was thinking maybe their is a loophole that if I wait 2 years. I have BCI433 on my schedule. I hate BCI433. I took it this semester and I dropped it last week because I got %40 on the mid term test.",
      "is_ivan": true
   },
   {
      "message": "Did the rapters get 12 3 pointers?",
      "is_ivan": true
   },
   {
      "message": "This is for David Aganie to answer. What are the most common questions that get asked on the interview. Also what are the things that immediately are a red flag during an interview. What is the proper position to sit and should I smile or keep a serious face during the interview.",
      "is_ivan": true
   },
   {
      "message": "If it does go long than 1 or 2 weeks, are you gonna be able to stop it from happening or is that not under your control?",
      "is_ivan": true
   },
   {
      "message": "I meant Derek.",
      "is_ivan": true
   },
   {
      "message": "Sorry Derek. I thought the strike was an important event to shed light on. If we want to stop the strike we have to get everyone aware of it. The more people that are against the strike the better the chance of stopping the strike before it is too late.",
      "is_ivan": true
   },
   {
      "message": "@everyoneWe need to all take this issue into consideration. We only have a few days to stop the teacher strike before it happends. Once the strike starts, it will be much harder then to stop the strike since most employees and proffessors might refuse to answer any replies even if it is an emergancy in this case. Hashtag the problem and ping seneca on twitter facebook whatsapp, etc. Someone needs to host a protest regarding our education system and to put an end to this strike. If the strike is happening this Friday, then we need a protest this week before it happends. Unfortunately I am busy this week with assignments, so I can't do it. I gave the idea though. If anyone wants to host the protest go ahead, just do it before Friday so the strike doesn't take away the attention of the protest.",
      "is_ivan": true
   },
   {
      "message": "I know this is a old message, but I wanted to ask you how was the results from the mid terms? Would you say he is a tough marker?",
      "is_ivan": true
   },
   {
      "message": "   Because of the If you don't earn 60k/year on your first job you're a failure mentality",
      "is_ivan": false
   },
   {
      "message": "   I mean.. mentally ill people are actually responsible for a disproportionately low number of violent crimes, it's mostly shitty, hateful sane people",
      "is_ivan": false
   },
   {
      "message": "should let the victims family set him on fire",
      "is_ivan": false
   },
   {
      "message": "then if you continue cyberbullying you get sent to The Filama",
      "is_ivan": false
   },
   {
      "message": "What happens if you bully someone in jail",
      "is_ivan": false
   },
   {
      "message": "you wouldnt even if you tried, thats how bad you are",
      "is_ivan": false
   },
   {
      "message": "In Canada there is no 1year limit your sentence  is based on your crime",
      "is_ivan": false
   },
   {
      "message": "Now there are  even cases prosecuted in the USA",
      "is_ivan": false
   },
   {
      "message": "Online/irl no difference anymore",
      "is_ivan": false
   },
   {
      "message": "I think that happened recently with the Steam Deck too... you could install Windows on it, but the drivers sucked",
      "is_ivan": false
   },
   {
      "message": "but i feel like i shouldn't while i have class cuz it's gonna slow me down until i know how to use it",
      "is_ivan": false
   },
   {
      "message": "I remember how Windows users would mock Linux users because drivers are missing and it's too complicated to fix",
      "is_ivan": false
   },
   {
      "message": "my audio drivers haven't worked for a week and i've scoured the internet for solutions, call customer support and nothing lol",
      "is_ivan": false
   },
   {
      "message": "You won't. I want to be a better admin so can give you access to host",
      "is_ivan": false
   },
   {
      "message": "never used kubernetes, dont wanna break your stuff 🤣",
      "is_ivan": false
   },
   {
      "message": "oh man good luck, designing the docker stuff is cool, but when it comes to debugging, just give up 😭",
      "is_ivan": false
   },
   {
      "message": "very dumb lmao",
      "is_ivan": false
   },
   {
      "message": "Idk last time I worked, it was for free",
      "is_ivan": false
   },
   {
      "message": "anyone ever had to study with Dr Tim Wong?",
      "is_ivan": false
   },
   {
      "message": "Because of the 'If you don't earn 60k/year on your first job you're a failure' mentality",
      "is_ivan": false
   },
   {
      "message": "my server is only 20gigs, its just hosting 2 sites",
      "is_ivan": false
   },
   {
      "message": "its more than enough",
      "is_ivan": false
   },
   {
      "message": "ideally i wouldve liked to slightly edit that function so i could make the same request with a button instead of dragging and dropping",
      "is_ivan": false
   },
   {
      "message": "thought itd be a simple task and it'd be faster to just use raw js that i already know",
      "is_ivan": false
   },
   {
      "message": "right now im making something that'll take in an image, process it on the server and spit out a processed image",
      "is_ivan": false
   },
   {
      "message": "ive got it all the way down to the point at which its processed, but i cant seem to return the base64 image URL",
      "is_ivan": false
   },
   {
      "message": "just without the jquery part of it",
      "is_ivan": false
   },
   {
      "message": "he prob just gave us free marks, cause test 4 I got perfect on the coding part, pretty sure I shouldn't have",
      "is_ivan": false
   }
]




